[
  {
    "title": "My pokemon isn't legal, what do I do???",
    "value": "The met location is incorrect. From the **edit pokemon** screen, go to the **misc** screen. Then click on **met location**. After, just select a legal met location from the list.\nYou'll need to find that using something like [serebii](https://serebii.net), or an in-game pokedex.\nNote: There may be other issues with the legality of your pokemon. Double check moves, level, etc., or use the legality checker in the same **misc** screen."
  },
  {
    "title": "Can we get legality checking please?",
    "value": "Believe it or not, you can! Go to the **edit pokemon** screen, then go to the **misc** screen. Click on the wireless icon. Congrats, you've accessed the legality checker.\nPlease note: the legality checker requires a network connection. It cannot be handled on-3ds as it would destroy the 3ds."
  },
  {
    "title": "When are we getting PKSM on Switch?",
    "value": "You can access LGPE saves by bridging PKSM on 3DS to Checkpoint on Switch. This is the best you'll get for now, possibly ever if you annoy ~~our lord and savior, Giratina~~ the FlagBrew team."
  },
  {
    "title": "When are we getting Sword and Shield support?",
    "value": "SWSH saves will be accessible by bridging to Checkpoint on switch, same as LGPE saves, when the next Checkpoint update releases. No, there is no ETA."
  },
  {
    "title": "My DeSmuME save is messed up and I can't load it, help!!!",
    "value": "If this save came from DeSmuME, then it likely has an extra 122 bytes at the end of it. Back up your file, then delete those last 122 bytes using a hex editor."
  },
  {
    "title": "Can we get trainer data editing?",
    "value": "You can do it through a script. Fair warning that it may get your game banned however."
  },
  {
    "title": "PKSM is erroring with Archive::init on launch, how can I fix it?",
    "value": "Backup and immediately restore PKSM's ExtData using [Checkpoint](https://github.com/FlagBrew/Checkpoint/releases)."
  },
  {
    "title": "Why can't I access the GPSS?",
    "value": "With PKSM 8.0.0, the GPSS was updated to v2.0. As such, if you haven't updated to 8.0.0+, the GPSS will not work."
  },
  {
    "title": "Why doesn't PKSM scan this QR?",
    "value": "**GPSS**: QRs from the [GPSS](https://flagbrew.org/gpss) (or <#586728153985056801>) have to be scanned in the GPSS section of PKSM. This can be accessed by opening `Storage`, then selecting the wifi button on the bottom screen, then pressing `X`.\n**PKX/PB7**: The file you're scanning *must* be of the same generation as the currently loaded save. This scanner is accessed by opening `Editor`, then pressing `L + R`. *Please note*: PK7 files are very finicky due to their size, and as such may need multiple tries.\n**Wonder Card**: These are scanned by opening `Events`, then pressing `L + R`."
  },
  {
    "title": "Why doesn't ServePKX work? How can I send pokemon to PKSM from my PC now?",
    "value": "ServePKX has been deprecated as of PKSM v6. There are three ways you can send pokemon to PKSM from PC now.\n**1**: (*Recommended*) Upload the pokemon to the GPSS using either the `.gpsspost` command in <#379201279479513100>, or through architdate's [Auto Legality Plugin](https://github.com/architdate/PKHeX-Plugins) for PKHeX.\n**2**: Create a QR code from the pkx file using PKHeX. Then, scan the QR code by opening `Editor` and pressing `L + R`.\n**3**: Place the pkx files you want to add at `/3ds/PKSM/inject/` and run the universal `injector.c` script."
  }
]